music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
  <select id='new-album-band' name="album[band_id]">
      <% Band.all.each do |band| %>