music_app/app/controllers/albums_controller.rb

    def show
        @album = Album.find_by(id: params[:id]) # why @user? show info in view?
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)

        if @album.save
---
INSERT INTO "albums" ("name", "band_id", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Evelong"], ["band_id", 1], ["year", 2222], ["created_at", "2019-06-07 00:27:38.462839"], ["updated_at", "2019-06-07 00:27:38.462839"]]