music_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "HLYlE7Bh1Q2xBTraUANFjw"], ["LIMIT", 1]]
---
    def current_user # sessions_controller#destroy, html
        return nil unless session[:session_token] # where does :session_token come from?
        @current_user ||= User.find_by(session_token: session[:session_token]) # why instance variable?