music_app/app/controllers/bands_controller.rb

    def show
        @band = Band.find_by(id: params[:id]) # why @user? show info in view?
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]