music_app/app/controllers/users_controller.rb

    def show
        @user = User.find_by(id: params[:id]) # why @user? show info in view?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.new(user_params) # why not @user?

        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"